//  Star Wars TSG
//  Darel Rex Finley, 2006-2008



//  Locations of Crawl font glyphs in the “Font (Crawl).bmp” image.
//
//  This data, and the “Font (Crawl).bmp” image, are not used by the compiled, end-user app.
//  See the file “Bitmap Font Compression” for more info.
//
//  Important:  All character values less than 256 are automatically converted to their Unicode values by compressBitmapFont -- unless they are negative, in which
//              case they are made positive but otherwise not changed.

#if COMPRESS_FONTS

long fontCompressionInfo_Crawl[]={
  5172,7462,                 //  image width, height
  574 ,                      //  row height
  (BYTE)  '0', 0,   0,202,   //  char value, row, x-position, width
  (BYTE)  '1', 0, 237,131,
  (BYTE)  '2', 0, 445,201,
  (BYTE)  '3', 0, 665,203,
  (BYTE)  '4', 0, 888,205,
  (BYTE)  '5', 0,1110,203,
  (BYTE)  '6', 0,1335,203,
  (BYTE)  '7', 0,1555,207,
  (BYTE)  '8', 0,1778,204,
  (BYTE)  '9', 0,2002,203,
  (BYTE)  'a', 0,2205,207,
  (BYTE)  'b', 0,2440,214,
  (BYTE)  'c', 0,2674,204,
  (BYTE)  'd', 0,2895,214,
  (BYTE)  'e', 0,3137,218,
  (BYTE)  'f', 0,3355,129,
  (BYTE)  'g', 0,3496,212,
  (BYTE)  'h', 0,3754,198,
  (BYTE)  'i', 0,3998, 64,
  (BYTE)  'j', 0,4084, 90,
  (BYTE)  'k', 0,4219,203,
  (BYTE)  'l', 0,4444, 62,
  (BYTE)  'm', 0,4553,312,
  (BYTE)  'n', 0,4909,199,
  (BYTE)  'o', 1,   0,224,
  (BYTE)  'p', 1, 255,213,
  (BYTE)  'q', 1, 486,214,
  (BYTE)  'r', 1, 745,130,
  (BYTE)  's', 1, 887,202,
  (BYTE)  't', 1,1102,126,
  (BYTE)  'u', 1,1255,198,
  (BYTE)  'v', 1,1480,218,
  (BYTE)  'w', 1,1701,309,
  (BYTE)  'x', 1,2014,216,
  (BYTE)  'y', 1,2236,218,
  (BYTE)  'z', 1,2460,186,
  (BYTE)  'A', 1,2646,279,
  (BYTE)  'B', 1,2956,243,
  (BYTE)  'C', 1,3232,260,
  (BYTE)  'D', 1,3533,251,
  (BYTE)  'E', 1,3823,225,
  (BYTE)  'F', 1,4088,212,
  (BYTE)  'G', 1,4319,274,
  (BYTE)  'H', 1,4644,238,
  (BYTE)  'I', 1,4928, 67,
  (BYTE)  'J', 2,   0,188,
  (BYTE)  'K', 2, 245,260,
  (BYTE)  'L', 2, 533,210,
  (BYTE)  'M', 2, 776,285,
  (BYTE)  'N', 2,1062,240,
  (BYTE)  'O', 2,1341,283,
  (BYTE)  'P', 2,1664,224,
  (BYTE)  'Q', 2,1919,284,
  (BYTE)  'R', 2,2242,242,
  (BYTE)  'S', 2,2516,245,
  (BYTE)  'T', 2,2773,240,
  (BYTE)  'U', 2,3041,238,
  (BYTE)  'V', 2,3309,258,
  (BYTE)  'W', 2,3573,372,
  (BYTE)  'X', 2,3951,260,
  (BYTE)  'Y', 2,4218,262,
  (BYTE)  'Z', 2,4488,229,
  (BYTE)  ',', 2,4717, 67,
  (BYTE)  ';', 2,4850, 67,
  (BYTE)  '‚', 2,4963, 64,
  (BYTE)  '„', 3,   0,151,
  (BYTE)  '.', 3, 197, 66,
  (BYTE)  '…', 3, 320,333,
  (BYTE)  ':', 3, 728, 66,
  (BYTE)  '/', 3, 794,164,
  (BYTE) '\\', 3,1016,164,
  (BYTE)  '⁄', 3,1193,207,
  (BYTE)  '!', 3,1482, 68,
  (BYTE)  '¡', 3,1616, 68,
  (BYTE)  '?', 3,1729,204,
  (BYTE)  '¿', 3,1970,205,
  (BYTE)  '@', 3,2233,321,
  (BYTE)  '#', 3,2584,228,
  (BYTE)  '€', 3,2825,263,
  (BYTE)  '£', 3,3117,209,
  (BYTE)  '¢', 3,3339,203,
  (BYTE)  '$', 3,3560,205,
  (BYTE)  '^', 3,3795,193,
  (BYTE)  '&', 3,4026,267,
  (BYTE)  '*', 3,4303,140,
  (BYTE)  '†', 3,4462,200,
  (BYTE)  '‡', 3,4685,201,
  (BYTE)  '(', 3,4907,109,
  (BYTE)  ')', 3,5031,117,
  (BYTE)  '[', 4,   0,104,
  (BYTE)  ']', 4, 117,105,
  (BYTE)  '{', 4, 252,131,
  (BYTE)  '}', 4, 417,131,
  (BYTE)  '-', 4, 548,115,
  (BYTE)  '–', 4, 671,231,
  (BYTE)  '—', 4, 942,311,
  (BYTE)  '_', 4,1295,230,
  (BYTE)  '+', 4,1528,218,
  (BYTE)  '÷', 4,1755,218,
  (BYTE)  '=', 4,1981,218,
  (BYTE)  '≠', 4,2208,218,
  (BYTE)  '≈', 4,2427,218,
  (BYTE)  '~', 4,2752,245,
  (BYTE)  '<', 4,3100,235,
  (BYTE)  '>', 4,3444,235,
  (BYTE)  '≤', 4,3681,218,
  (BYTE)  '≥', 4,3901,218,
  (BYTE)  '±', 4,4120,218,
  (BYTE)  '%', 4,4345,342,
  (BYTE)  '‰', 4,4691,407,
  (BYTE)  '∞', 5,   0,279,
  (BYTE)  '§', 5, 291,199,
  (BYTE)  '¶', 5, 502,229,
  (BYTE)  'ª', 5, 731,140,
  (BYTE)  'º', 5, 874,148,
  (BYTE)  'ﬁ', 5,1023,218,
  (BYTE)  'ﬂ', 5,1268,219,
  (BYTE)  '“', 5,1487,155,
  (BYTE)  '‘', 5,1686, 63,
  (BYTE)  '’', 5,1796, 63,
  (BYTE)  '”', 5,1911,155,
  (BYTE)  '‹', 5,2115, 73,
  (BYTE)  '›', 5,2248, 73,
  (BYTE)  '«', 5,2383,159,
  (BYTE)  '»', 5,2605,159,
  (BYTE)  '`', 5,2764,105,
  (BYTE)  'à', 5,2906,207,
  (BYTE)  'À', 5,3128,279,
  (BYTE)  'è', 5,3416,218,
  (BYTE)  'È', 5,3661,225,
  (BYTE)  'ì', 5,3887,104,
  (BYTE)  'Ì', 5,3998,104,
  (BYTE)  'ò', 5,4131,224,
  (BYTE)  'Ò', 5,4381,283,
  (BYTE)  'ù', 5,4698,198,
  (BYTE)  'Ù', 5,4934,238,
  (BYTE)  '´', 6,   0,105,
  (BYTE)  '˝', 6, 213,177,
  (BYTE)  'á', 6, 466,207,
  (BYTE)  'Á', 6, 687,279,
  (BYTE)  'é', 6, 975,218,
  (BYTE)  'É', 6,1220,225,
  (BYTE)  'í', 6,1478,105,
  (BYTE)  'Í', 6,1589,105,
  (BYTE)  'ó', 6,1802,224,
  (BYTE)  'Ó', 6,2052,283,
  (BYTE)  'ú', 6,2368,198,
  (BYTE)  'Ú', 6,2618,238,
  (BYTE)  '¨', 6,2856,136,
  (BYTE)  'ä', 6,2998,207,
  (BYTE)  'Ä', 6,3220,279,
  (BYTE)  'ë', 6,3508,218,
  (BYTE)  'Ë', 6,3753,225,
  (BYTE)  'ï', 6,3979,136,
  (BYTE)  'Ï', 6,4201,136,
  (BYTE)  'ö', 6,4407,224,
  (BYTE)  'Ö', 6,4658,283,
  (BYTE)  'ü', 6,4974,198,
  (BYTE)  'Ü', 7,   0,238,
  (BYTE)  'ÿ', 7, 263,218,
  (BYTE)  'Ÿ', 7, 488,262,
  (BYTE)  'ˇ', 7, 750,147,
  (BYTE)  'ˆ', 7, 898,147,
  (BYTE)  'â', 7,1045,207,
  (BYTE)  'Â', 7,1252,279,
  (BYTE)  'ê', 7,1540,218,
  (BYTE)  'Ê', 7,1785,225,
  (BYTE)  'î', 7,2010,147,
  (BYTE)  'Î', 7,2228,147,
  (BYTE)  'ô', 7,2478,224,
  (BYTE)  'Ô', 7,2728,283,
  (BYTE)  'û', 7,3044,198,
  (BYTE)  'Û', 7,3294,238,
  (BYTE)  '˜', 7,3532,153,
  (BYTE)  'ã', 7,3793,207,
  (BYTE)  'Ã', 7,4015,279,
  (BYTE)  'õ', 7,4307,224,
  (BYTE)  'Õ', 7,4557,283,
  (BYTE)  'ñ', 7,4875,199,
  (BYTE)  'Ñ', 8,   0,240,
  (BYTE)  '¸', 8, 240,101,
  (BYTE)  '˛', 8, 382, 92,
  (BYTE)  'ç', 8, 504,204,
  (BYTE)  'Ç', 8, 732,260,
  (BYTE)  'å', 8,1014,207,
  (BYTE)  'Å', 8,1235,279,
  (BYTE)  'æ', 8,1525,340,
  (BYTE)  'Æ', 8,1874,386,
  (BYTE)  'œ', 8,2282,359,
  (BYTE)  'Œ', 8,2661,372,
  (BYTE)  'π', 8,3044,235,
  (BYTE)  '∏', 8,3400,297,
  (BYTE)  'ø', 8,3715,233,
  (BYTE)  'Ø', 8,3966,291,
  (BYTE)  '∑', 8,4257,245,
  (BYTE)  'ß', 8,4542,209,
  (BYTE)  '∂', 8,4754,221,
  (BYTE)  '∆', 9,3173,279,
  (BYTE)  'Ω', 9,4599,292,
  (BYTE)  '¥', 9,4893,237,
  (BYTE)  '™', 9,   0,320,
  (BYTE)  '®', 9, 368,294,
  (BYTE)  '©', 9, 774,294,
  (BYTE)  '˙', 9,1105, 57,
  (BYTE)  '˚', 9,1220, 93,
  (BYTE)  '•', 9,1356, 93,
  (BYTE)  '°', 9,1488,133,
  (BYTE)  '·', 9,1652, 72,
  (BYTE)  '', 9,1761,286,
  (BYTE)  '◊', 9,2060,195,
  (BYTE)  '√', 9,2358,267,
  (BYTE)  'ƒ', 9,2703,216,
  (BYTE)  '∫', 9,2996,174,
  (BYTE)  'µ', 9,3461,254,
  (BYTE)  '¬', 9,3715,218,
  (BYTE)  'ı', 9,3963, 64,
  (BYTE)  '|', 9,4080, 58,
  (BYTE)  '¯', 9,4158,145,
  (BYTE)  '˘', 9,4405,142,
  (BYTE)  ' ', 9,2257, 99,
  268        ,10,   0,260,    //  'C' with caron
  352        ,10, 260,245,    //  'S' with caron
  381        ,10, 505,229,    //  'Z' with caron
  269        ,10, 734,203,    //  'c' with caron
  353        ,10, 937,202,    //  's' with caron
  382        ,10,1139,186,    //  'z' with caron
  304        ,10,1388, 67,    //  'I' with dot accent
  273        ,10,1455,239,    //  'd' with stroke
  272        ,10,1694,278,    //  'D' with stroke
  259        ,10,1972,207,    //  'a' with breve
  258        ,10,2179,277,    //  'A' with breve
  261        ,10,2456,207,    //  'a' with ogonek
  260        ,10,2663,280,    //  'A' with ogonek
  263        ,10,2942,202,    //  'c' acute
  262        ,10,3144,260,    //  'C' acute
  271        ,10,3404,294,    //  'd' with caron
  270        ,10,3698,251,    //  'D' with caron
  283        ,10,3949,218,    //  'e' with caron
  282        ,10,4167,222,    //  'E' with caron
  281        ,10,4389,219,    //  'e' with ogonek
  280        ,10,4608,222,    //  'E' with ogonek
  287        ,10,4830,212,    //  'g' with breve
  286        ,11,   0,274,    //  'G' with breve
  318        ,11, 274,104,    //  'l' acute
  317        ,11, 378,211,    //  'L' acute
  314        ,11, 589,143,    //  'l' with caron (apostrophe style)
  313        ,11, 732,211,    //  'L' with caron (apostrophe style)
  322        ,11, 943,126,    //  'l' with slash
  321        ,11,1069,244,    //  'L' with slash
  324        ,11,1313,199,    //  'n' acute
  323        ,11,1512,240,    //  'N' acute
  328        ,11,1752,198,    //  'n' with caron
  327        ,11,1950,240,    //  'N' with caron
  337        ,11,2190,225,    //  'o' double-acute
  336        ,11,2415,283,    //  'O' double-acute
  341        ,11,2698,130,    //  'r' acute
  340        ,11,2828,241,    //  'R' acute
  345        ,11,3069,147,    //  'r' with caron
  344        ,11,3216,241,    //  'R' with caron
  347        ,11,3457,202,    //  's' acute
  346        ,11,3659,246,    //  'S' acute
  351        ,11,3905,202,    //  's' with cedilla
  350        ,11,4107,245,    //  'S' with cedilla
  537        ,11,4352,202,    //  's' with comma accent
  536        ,11,4554,246,    //  'S' with comma accent
  357        ,11,4800,186,    //  't' with caron (apostrophe style)
  356        ,12,   0,241,    //  'T' with caron
  539        ,12, 241,126,    //  't' with comma accent
  538        ,12, 367,240,    //  'T' with comma accent
  369        ,12, 607,199,    //  'u' double-acute
  368        ,12, 806,238,    //  'U' double-acute
  367        ,12,1044,199,    //  'u' with ring
  366        ,12,1243,239,    //  'U' with ring
  378        ,12,1482,186,    //  'z' acute
  377        ,12,1668,230,    //  'Z' acute
  380        ,12,1898,187,    //  'z' with dot accent
  379        ,12,2085,229,    //  'Z' with dot accent
  -240       ,12,2314,213,    //  eth (lowercase)
  -208       ,12,2527,277,    //  eth (uppercase) (same as 'D' with stroke)
  -253       ,12,3328,217,    //  'y' acute
  -221       ,12,3545,261,    //  'Y' acute
  -254       ,12,3806,212,    //  thorn (lowercase)
  -222       ,12,4018,228 }   //  thorn (uppercase)
;

#endif